// 9 символов (горизонтальные линии) (1-58-2---)(-9--764-5)(2--4--819)(-19--73-6)(762-83-9-)(----61-5-)(--76---3-)(43--2-5-1)(6--3-89--)

// 9 символов (вертикальные) (1-2-7--46)
// (1 - 58 - 2-- -)
//     (-9--764 - 5)
//     (2--4--819)
//     (-19--73 - 6)
//     (762 - 83 - 9 -)
//     (----61 - 5 -)
//     (--76--- 3 -)
//     (43--2 - 5 - 1)
//     (6--3 - 89--)

const str = '1|-|5|8|-|2|-|-|-';

function xxx(a) {
    const arrStr = a.split('');

    let newStr = '';

    for (let i = 0; i < arrStr.length; i += 1) {
        if (arrStr[i] === '-') {
            arrStr[i] = (Math.floor(Math.random() * (10 - 1) + 1));
            newStr += arrStr[i];
        } else {
            newStr += arrStr[i];
        }
    }
    return newStr;
}

console.log(xxx(str));
